apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_pcr.h
/****************************************************************************
 * arch/risc-v/src/esp32c6/hardware/esp32c6_pcr.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_RISCV_SRC_ESP32C6_HARDWARE_ESP32C6_PCR_H
#define __ARCH_RISCV_SRC_ESP32C6_HARDWARE_ESP32C6_PCR_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32c6_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* PCR_UART0_CONF_REG register
 * UART0 configuration register
 */

#define PCR_UART0_CONF_REG (DR_REG_PCR_BASE + 0x0)

/* PCR_UART0_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset uart0 module
 */

#define PCR_UART0_RST_EN    (BIT(1))
#define PCR_UART0_RST_EN_M  (PCR_UART0_RST_EN_V << PCR_UART0_RST_EN_S)
#define PCR_UART0_RST_EN_V  0x00000001
#define PCR_UART0_RST_EN_S  1

/* PCR_UART0_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable uart0 apb clock
 */

#define PCR_UART0_CLK_EN    (BIT(0))
#define PCR_UART0_CLK_EN_M  (PCR_UART0_CLK_EN_V << PCR_UART0_CLK_EN_S)
#define PCR_UART0_CLK_EN_V  0x00000001
#define PCR_UART0_CLK_EN_S  0

/* PCR_UART0_SCLK_CONF_REG register
 * UART0_SCLK configuration register
 */

#define PCR_UART0_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x4)

/* PCR_UART0_SCLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable uart0 function clock
 */

#define PCR_UART0_SCLK_EN    (BIT(22))
#define PCR_UART0_SCLK_EN_M  (PCR_UART0_SCLK_EN_V << PCR_UART0_SCLK_EN_S)
#define PCR_UART0_SCLK_EN_V  0x00000001
#define PCR_UART0_SCLK_EN_S  22

/* PCR_UART0_SCLK_SEL : R/W; bitpos: [21:20]; default: 3;
 * set this field to select clock-source. 0: do not select anyone clock, 1:
 * 80MHz, 2: FOSC, 3(default): XTAL.
 */

#define PCR_UART0_SCLK_SEL    0x00000003
#define PCR_UART0_SCLK_SEL_M  (PCR_UART0_SCLK_SEL_V << PCR_UART0_SCLK_SEL_S)
#define PCR_UART0_SCLK_SEL_V  0x00000003
#define PCR_UART0_SCLK_SEL_S  20

/* PCR_UART0_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 * The integral part of the frequency divider factor of the uart0 function
 * clock.
 */

#define PCR_UART0_SCLK_DIV_NUM    0x000000ff
#define PCR_UART0_SCLK_DIV_NUM_M  (PCR_UART0_SCLK_DIV_NUM_V << PCR_UART0_SCLK_DIV_NUM_S)
#define PCR_UART0_SCLK_DIV_NUM_V  0x000000ff
#define PCR_UART0_SCLK_DIV_NUM_S  12

/* PCR_UART0_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 * The numerator of the frequency divider factor of the uart0 function clock.
 */

#define PCR_UART0_SCLK_DIV_B    0x0000003f
#define PCR_UART0_SCLK_DIV_B_M  (PCR_UART0_SCLK_DIV_B_V << PCR_UART0_SCLK_DIV_B_S)
#define PCR_UART0_SCLK_DIV_B_V  0x0000003f
#define PCR_UART0_SCLK_DIV_B_S  6

/* PCR_UART0_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 * The  denominator of the frequency divider factor of the uart0 function
 * clock.
 */

#define PCR_UART0_SCLK_DIV_A    0x0000003f
#define PCR_UART0_SCLK_DIV_A_M  (PCR_UART0_SCLK_DIV_A_V << PCR_UART0_SCLK_DIV_A_S)
#define PCR_UART0_SCLK_DIV_A_V  0x0000003f
#define PCR_UART0_SCLK_DIV_A_S  0

/* PCR_UART0_PD_CTRL_REG register
 * UART0 power control register
 */

#define PCR_UART0_PD_CTRL_REG (DR_REG_PCR_BASE + 0x8)

/* PCR_UART0_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 * Set this bit to force power up UART0 memory.
 */

#define PCR_UART0_MEM_FORCE_PD    (BIT(2))
#define PCR_UART0_MEM_FORCE_PD_M  (PCR_UART0_MEM_FORCE_PD_V << PCR_UART0_MEM_FORCE_PD_S)
#define PCR_UART0_MEM_FORCE_PD_V  0x00000001
#define PCR_UART0_MEM_FORCE_PD_S  2

/* PCR_UART0_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 * Set this bit to force power down UART0 memory.
 */

#define PCR_UART0_MEM_FORCE_PU    (BIT(1))
#define PCR_UART0_MEM_FORCE_PU_M  (PCR_UART0_MEM_FORCE_PU_V << PCR_UART0_MEM_FORCE_PU_S)
#define PCR_UART0_MEM_FORCE_PU_V  0x00000001
#define PCR_UART0_MEM_FORCE_PU_S  1

/* PCR_UART1_CONF_REG register
 * UART1 configuration register
 */

#define PCR_UART1_CONF_REG (DR_REG_PCR_BASE + 0xc)

/* PCR_UART1_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset uart1 module
 */

#define PCR_UART1_RST_EN    (BIT(1))
#define PCR_UART1_RST_EN_M  (PCR_UART1_RST_EN_V << PCR_UART1_RST_EN_S)
#define PCR_UART1_RST_EN_V  0x00000001
#define PCR_UART1_RST_EN_S  1

/* PCR_UART1_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable uart1 apb clock
 */

#define PCR_UART1_CLK_EN    (BIT(0))
#define PCR_UART1_CLK_EN_M  (PCR_UART1_CLK_EN_V << PCR_UART1_CLK_EN_S)
#define PCR_UART1_CLK_EN_V  0x00000001
#define PCR_UART1_CLK_EN_S  0

/* PCR_UART1_SCLK_CONF_REG register
 * UART1_SCLK configuration register
 */

#define PCR_UART1_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x10)

/* PCR_UART1_SCLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable uart0 function clock
 */

#define PCR_UART1_SCLK_EN    (BIT(22))
#define PCR_UART1_SCLK_EN_M  (PCR_UART1_SCLK_EN_V << PCR_UART1_SCLK_EN_S)
#define PCR_UART1_SCLK_EN_V  0x00000001
#define PCR_UART1_SCLK_EN_S  22

/* PCR_UART1_SCLK_SEL : R/W; bitpos: [21:20]; default: 3;
 * set this field to select clock-source. 0: do not select anyone clock, 1:
 * 80MHz, 2: FOSC, 3(default): XTAL.
 */

#define PCR_UART1_SCLK_SEL    0x00000003
#define PCR_UART1_SCLK_SEL_M  (PCR_UART1_SCLK_SEL_V << PCR_UART1_SCLK_SEL_S)
#define PCR_UART1_SCLK_SEL_V  0x00000003
#define PCR_UART1_SCLK_SEL_S  20

