apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_pcr.h
/* PCR_UART1_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 * The integral part of the frequency divider factor of the uart1 function
 * clock.
 */

#define PCR_UART1_SCLK_DIV_NUM    0x000000ff
#define PCR_UART1_SCLK_DIV_NUM_M  (PCR_UART1_SCLK_DIV_NUM_V << PCR_UART1_SCLK_DIV_NUM_S)
#define PCR_UART1_SCLK_DIV_NUM_V  0x000000ff
#define PCR_UART1_SCLK_DIV_NUM_S  12

/* PCR_UART1_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 * The numerator of the frequency divider factor of the uart1 function clock.
 */

#define PCR_UART1_SCLK_DIV_B    0x0000003f
#define PCR_UART1_SCLK_DIV_B_M  (PCR_UART1_SCLK_DIV_B_V << PCR_UART1_SCLK_DIV_B_S)
#define PCR_UART1_SCLK_DIV_B_V  0x0000003f
#define PCR_UART1_SCLK_DIV_B_S  6

/* PCR_UART1_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 * The  denominator of the frequency divider factor of the uart1 function
 * clock.
 */

#define PCR_UART1_SCLK_DIV_A    0x0000003f
#define PCR_UART1_SCLK_DIV_A_M  (PCR_UART1_SCLK_DIV_A_V << PCR_UART1_SCLK_DIV_A_S)
#define PCR_UART1_SCLK_DIV_A_V  0x0000003f
#define PCR_UART1_SCLK_DIV_A_S  0

/* PCR_UART1_PD_CTRL_REG register
 * UART1 power control register
 */

#define PCR_UART1_PD_CTRL_REG (DR_REG_PCR_BASE + 0x14)

/* PCR_UART1_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 * Set this bit to force power up UART1 memory.
 */

#define PCR_UART1_MEM_FORCE_PD    (BIT(2))
#define PCR_UART1_MEM_FORCE_PD_M  (PCR_UART1_MEM_FORCE_PD_V << PCR_UART1_MEM_FORCE_PD_S)
#define PCR_UART1_MEM_FORCE_PD_V  0x00000001
#define PCR_UART1_MEM_FORCE_PD_S  2

/* PCR_UART1_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 * Set this bit to force power down UART1 memory.
 */

#define PCR_UART1_MEM_FORCE_PU    (BIT(1))
#define PCR_UART1_MEM_FORCE_PU_M  (PCR_UART1_MEM_FORCE_PU_V << PCR_UART1_MEM_FORCE_PU_S)
#define PCR_UART1_MEM_FORCE_PU_V  0x00000001
#define PCR_UART1_MEM_FORCE_PU_S  1

/* PCR_MSPI_CONF_REG register
 * MSPI configuration register
 */

#define PCR_MSPI_CONF_REG (DR_REG_PCR_BASE + 0x18)

/* PCR_MSPI_PLL_CLK_EN : R/W; bitpos: [2]; default: 1;
 * Set 1 to enable mspi pll clock
 */

#define PCR_MSPI_PLL_CLK_EN    (BIT(2))
#define PCR_MSPI_PLL_CLK_EN_M  (PCR_MSPI_PLL_CLK_EN_V << PCR_MSPI_PLL_CLK_EN_S)
#define PCR_MSPI_PLL_CLK_EN_V  0x00000001
#define PCR_MSPI_PLL_CLK_EN_S  2

/* PCR_MSPI_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset mspi module
 */

#define PCR_MSPI_RST_EN    (BIT(1))
#define PCR_MSPI_RST_EN_M  (PCR_MSPI_RST_EN_V << PCR_MSPI_RST_EN_S)
#define PCR_MSPI_RST_EN_V  0x00000001
#define PCR_MSPI_RST_EN_S  1

/* PCR_MSPI_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable mspi clock, include mspi pll clock
 */

#define PCR_MSPI_CLK_EN    (BIT(0))
#define PCR_MSPI_CLK_EN_M  (PCR_MSPI_CLK_EN_V << PCR_MSPI_CLK_EN_S)
#define PCR_MSPI_CLK_EN_V  0x00000001
#define PCR_MSPI_CLK_EN_S  0

/* PCR_MSPI_CLK_CONF_REG register
 * MSPI_CLK configuration register
 */

#define PCR_MSPI_CLK_CONF_REG (DR_REG_PCR_BASE + 0x1c)

/* PCR_MSPI_FAST_HS_DIV_NUM : R/W; bitpos: [15:8]; default: 3;
 * Set as one within (3,4,5) to generate div4(default)/div5/div6 of
 * high-speed clock-source to drive clk_mspi_fast. Only avaiable whe the
 * clck-source is a high-speed clock-source such as SPLL.
 */

#define PCR_MSPI_FAST_HS_DIV_NUM    0x000000ff
#define PCR_MSPI_FAST_HS_DIV_NUM_M  (PCR_MSPI_FAST_HS_DIV_NUM_V << PCR_MSPI_FAST_HS_DIV_NUM_S)
#define PCR_MSPI_FAST_HS_DIV_NUM_V  0x000000ff
#define PCR_MSPI_FAST_HS_DIV_NUM_S  8

/* PCR_MSPI_FAST_LS_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 * Set as one within (0,1,2) to generate div1(default)/div2/div4 of
 * low-speed clock-source to drive clk_mspi_fast. Only avaiable whe the
 * clck-source is a low-speed clock-source such as XTAL/FOSC.
 */

#define PCR_MSPI_FAST_LS_DIV_NUM    0x000000ff
#define PCR_MSPI_FAST_LS_DIV_NUM_M  (PCR_MSPI_FAST_LS_DIV_NUM_V << PCR_MSPI_FAST_LS_DIV_NUM_S)
#define PCR_MSPI_FAST_LS_DIV_NUM_V  0x000000ff
#define PCR_MSPI_FAST_LS_DIV_NUM_S  0

/* PCR_I2C_CONF_REG register
 * I2C configuration register
 */

#define PCR_I2C_CONF_REG (DR_REG_PCR_BASE + 0x20)

/* PCR_I2C_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset i2c module
 */

#define PCR_I2C_RST_EN    (BIT(1))
#define PCR_I2C_RST_EN_M  (PCR_I2C_RST_EN_V << PCR_I2C_RST_EN_S)
#define PCR_I2C_RST_EN_V  0x00000001
#define PCR_I2C_RST_EN_S  1

/* PCR_I2C_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable i2c apb clock
 */

#define PCR_I2C_CLK_EN    (BIT(0))
#define PCR_I2C_CLK_EN_M  (PCR_I2C_CLK_EN_V << PCR_I2C_CLK_EN_S)
#define PCR_I2C_CLK_EN_V  0x00000001
#define PCR_I2C_CLK_EN_S  0

/* PCR_I2C_SCLK_CONF_REG register
 * I2C_SCLK configuration register
 */

#define PCR_I2C_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x24)

/* PCR_I2C_SCLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable i2c function clock
 */

#define PCR_I2C_SCLK_EN    (BIT(22))
#define PCR_I2C_SCLK_EN_M  (PCR_I2C_SCLK_EN_V << PCR_I2C_SCLK_EN_S)
#define PCR_I2C_SCLK_EN_V  0x00000001
#define PCR_I2C_SCLK_EN_S  22

/* PCR_I2C_SCLK_SEL : R/W; bitpos: [20]; default: 0;
 * set this field to select clock-source. 0(default): XTAL, 1: FOSC.
 */

#define PCR_I2C_SCLK_SEL    (BIT(20))
#define PCR_I2C_SCLK_SEL_M  (PCR_I2C_SCLK_SEL_V << PCR_I2C_SCLK_SEL_S)
#define PCR_I2C_SCLK_SEL_V  0x00000001
#define PCR_I2C_SCLK_SEL_S  20

/* PCR_I2C_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 * The integral part of the frequency divider factor of the i2c function
 * clock.
 */

#define PCR_I2C_SCLK_DIV_NUM    0x000000ff
#define PCR_I2C_SCLK_DIV_NUM_M  (PCR_I2C_SCLK_DIV_NUM_V << PCR_I2C_SCLK_DIV_NUM_S)
#define PCR_I2C_SCLK_DIV_NUM_V  0x000000ff
#define PCR_I2C_SCLK_DIV_NUM_S  12

/* PCR_I2C_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 * The numerator of the frequency divider factor of the i2c function clock.
 */

#define PCR_I2C_SCLK_DIV_B    0x0000003f
#define PCR_I2C_SCLK_DIV_B_M  (PCR_I2C_SCLK_DIV_B_V << PCR_I2C_SCLK_DIV_B_S)
#define PCR_I2C_SCLK_DIV_B_V  0x0000003f
#define PCR_I2C_SCLK_DIV_B_S  6

/* PCR_I2C_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 * The  denominator of the frequency divider factor of the i2c function
 * clock.
 */

