apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_pcr.h
#define PCR_I2C_SCLK_DIV_A    0x0000003f
#define PCR_I2C_SCLK_DIV_A_M  (PCR_I2C_SCLK_DIV_A_V << PCR_I2C_SCLK_DIV_A_S)
#define PCR_I2C_SCLK_DIV_A_V  0x0000003f
#define PCR_I2C_SCLK_DIV_A_S  0

/* PCR_UHCI_CONF_REG register
 * UHCI configuration register
 */

#define PCR_UHCI_CONF_REG (DR_REG_PCR_BASE + 0x28)

/* PCR_UHCI_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset uhci module
 */

#define PCR_UHCI_RST_EN    (BIT(1))
#define PCR_UHCI_RST_EN_M  (PCR_UHCI_RST_EN_V << PCR_UHCI_RST_EN_S)
#define PCR_UHCI_RST_EN_V  0x00000001
#define PCR_UHCI_RST_EN_S  1

/* PCR_UHCI_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable uhci clock
 */

#define PCR_UHCI_CLK_EN    (BIT(0))
#define PCR_UHCI_CLK_EN_M  (PCR_UHCI_CLK_EN_V << PCR_UHCI_CLK_EN_S)
#define PCR_UHCI_CLK_EN_V  0x00000001
#define PCR_UHCI_CLK_EN_S  0

/* PCR_RMT_CONF_REG register
 * RMT configuration register
 */

#define PCR_RMT_CONF_REG (DR_REG_PCR_BASE + 0x2c)

/* PCR_RMT_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset rmt module
 */

#define PCR_RMT_RST_EN    (BIT(1))
#define PCR_RMT_RST_EN_M  (PCR_RMT_RST_EN_V << PCR_RMT_RST_EN_S)
#define PCR_RMT_RST_EN_V  0x00000001
#define PCR_RMT_RST_EN_S  1

/* PCR_RMT_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable rmt apb clock
 */

#define PCR_RMT_CLK_EN    (BIT(0))
#define PCR_RMT_CLK_EN_M  (PCR_RMT_CLK_EN_V << PCR_RMT_CLK_EN_S)
#define PCR_RMT_CLK_EN_V  0x00000001
#define PCR_RMT_CLK_EN_S  0

/* PCR_RMT_SCLK_CONF_REG register
 * RMT_SCLK configuration register
 */

#define PCR_RMT_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x30)

/* PCR_RMT_SCLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable rmt function clock
 */

#define PCR_RMT_SCLK_EN    (BIT(22))
#define PCR_RMT_SCLK_EN_M  (PCR_RMT_SCLK_EN_V << PCR_RMT_SCLK_EN_S)
#define PCR_RMT_SCLK_EN_V  0x00000001
#define PCR_RMT_SCLK_EN_S  22

/* PCR_RMT_SCLK_SEL : R/W; bitpos: [21:20]; default: 1;
 * set this field to select clock-source. 0: do not select anyone clock,
 * 1(default): 80MHz, 2: FOSC, 3: XTAL.
 */

#define PCR_RMT_SCLK_SEL    0x00000003
#define PCR_RMT_SCLK_SEL_M  (PCR_RMT_SCLK_SEL_V << PCR_RMT_SCLK_SEL_S)
#define PCR_RMT_SCLK_SEL_V  0x00000003
#define PCR_RMT_SCLK_SEL_S  20

/* PCR_RMT_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 1;
 * The integral part of the frequency divider factor of the rmt function
 * clock.
 */

#define PCR_RMT_SCLK_DIV_NUM    0x000000ff
#define PCR_RMT_SCLK_DIV_NUM_M  (PCR_RMT_SCLK_DIV_NUM_V << PCR_RMT_SCLK_DIV_NUM_S)
#define PCR_RMT_SCLK_DIV_NUM_V  0x000000ff
#define PCR_RMT_SCLK_DIV_NUM_S  12

/* PCR_RMT_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 * The numerator of the frequency divider factor of the rmt function clock.
 */

#define PCR_RMT_SCLK_DIV_B    0x0000003f
#define PCR_RMT_SCLK_DIV_B_M  (PCR_RMT_SCLK_DIV_B_V << PCR_RMT_SCLK_DIV_B_S)
#define PCR_RMT_SCLK_DIV_B_V  0x0000003f
#define PCR_RMT_SCLK_DIV_B_S  6

/* PCR_RMT_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 * The  denominator of the frequency divider factor of the rmt function
 * clock.
 */

#define PCR_RMT_SCLK_DIV_A    0x0000003f
#define PCR_RMT_SCLK_DIV_A_M  (PCR_RMT_SCLK_DIV_A_V << PCR_RMT_SCLK_DIV_A_S)
#define PCR_RMT_SCLK_DIV_A_V  0x0000003f
#define PCR_RMT_SCLK_DIV_A_S  0

/* PCR_LEDC_CONF_REG register
 * LEDC configuration register
 */

#define PCR_LEDC_CONF_REG (DR_REG_PCR_BASE + 0x34)

/* PCR_LEDC_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset ledc module
 */

#define PCR_LEDC_RST_EN    (BIT(1))
#define PCR_LEDC_RST_EN_M  (PCR_LEDC_RST_EN_V << PCR_LEDC_RST_EN_S)
#define PCR_LEDC_RST_EN_V  0x00000001
#define PCR_LEDC_RST_EN_S  1

/* PCR_LEDC_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable ledc apb clock
 */

#define PCR_LEDC_CLK_EN    (BIT(0))
#define PCR_LEDC_CLK_EN_M  (PCR_LEDC_CLK_EN_V << PCR_LEDC_CLK_EN_S)
#define PCR_LEDC_CLK_EN_V  0x00000001
#define PCR_LEDC_CLK_EN_S  0

/* PCR_LEDC_SCLK_CONF_REG register
 * LEDC_SCLK configuration register
 */

#define PCR_LEDC_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x38)

/* PCR_LEDC_SCLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable ledc function clock
 */

#define PCR_LEDC_SCLK_EN    (BIT(22))
#define PCR_LEDC_SCLK_EN_M  (PCR_LEDC_SCLK_EN_V << PCR_LEDC_SCLK_EN_S)
#define PCR_LEDC_SCLK_EN_V  0x00000001
#define PCR_LEDC_SCLK_EN_S  22

/* PCR_LEDC_SCLK_SEL : R/W; bitpos: [21:20]; default: 0;
 * set this field to select clock-source. 0(default): do not select anyone
 * clock, 1: 80MHz, 2: FOSC, 3: XTAL.
 */

#define PCR_LEDC_SCLK_SEL    0x00000003
#define PCR_LEDC_SCLK_SEL_M  (PCR_LEDC_SCLK_SEL_V << PCR_LEDC_SCLK_SEL_S)
#define PCR_LEDC_SCLK_SEL_V  0x00000003
#define PCR_LEDC_SCLK_SEL_S  20

/* PCR_TIMERGROUP0_CONF_REG register
 * TIMERGROUP0 configuration register
 */

#define PCR_TIMERGROUP0_CONF_REG (DR_REG_PCR_BASE + 0x3c)

/* PCR_TG0_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset timer_group0 module
 */

#define PCR_TG0_RST_EN    (BIT(1))
#define PCR_TG0_RST_EN_M  (PCR_TG0_RST_EN_V << PCR_TG0_RST_EN_S)
#define PCR_TG0_RST_EN_V  0x00000001
#define PCR_TG0_RST_EN_S  1

/* PCR_TG0_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable timer_group0 apb clock
 */

#define PCR_TG0_CLK_EN    (BIT(0))
#define PCR_TG0_CLK_EN_M  (PCR_TG0_CLK_EN_V << PCR_TG0_CLK_EN_S)
#define PCR_TG0_CLK_EN_V  0x00000001
#define PCR_TG0_CLK_EN_S  0

/* PCR_TIMERGROUP0_TIMER_CLK_CONF_REG register
 * TIMERGROUP0_TIMER_CLK configuration register
 */

#define PCR_TIMERGROUP0_TIMER_CLK_CONF_REG (DR_REG_PCR_BASE + 0x40)

/* PCR_TG0_TIMER_CLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable timer_group0 timer clock
 */

#define PCR_TG0_TIMER_CLK_EN    (BIT(22))
#define PCR_TG0_TIMER_CLK_EN_M  (PCR_TG0_TIMER_CLK_EN_V << PCR_TG0_TIMER_CLK_EN_S)
#define PCR_TG0_TIMER_CLK_EN_V  0x00000001
#define PCR_TG0_TIMER_CLK_EN_S  22

/* PCR_TG0_TIMER_CLK_SEL : R/W; bitpos: [21:20]; default: 0;
 * set this field to select clock-source. 0(default): XTAL, 1: 80MHz, 2:
 * FOSC, 3: reserved.
 */

#define PCR_TG0_TIMER_CLK_SEL    0x00000003
#define PCR_TG0_TIMER_CLK_SEL_M  (PCR_TG0_TIMER_CLK_SEL_V << PCR_TG0_TIMER_CLK_SEL_S)
#define PCR_TG0_TIMER_CLK_SEL_V  0x00000003
#define PCR_TG0_TIMER_CLK_SEL_S  20

/* PCR_TIMERGROUP0_WDT_CLK_CONF_REG register
 * TIMERGROUP0_WDT_CLK configuration register
 */

#define PCR_TIMERGROUP0_WDT_CLK_CONF_REG (DR_REG_PCR_BASE + 0x44)

/* PCR_TG0_WDT_CLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable timer_group0 wdt clock
 */

#define PCR_TG0_WDT_CLK_EN    (BIT(22))
#define PCR_TG0_WDT_CLK_EN_M  (PCR_TG0_WDT_CLK_EN_V << PCR_TG0_WDT_CLK_EN_S)
#define PCR_TG0_WDT_CLK_EN_V  0x00000001
#define PCR_TG0_WDT_CLK_EN_S  22

