apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_pcr.h
/* PCR_TG0_WDT_CLK_SEL : R/W; bitpos: [21:20]; default: 0;
 * set this field to select clock-source. 0(default): XTAL, 1: 80MHz, 2:
 * FOSC, 3: reserved.
 */

#define PCR_TG0_WDT_CLK_SEL    0x00000003
#define PCR_TG0_WDT_CLK_SEL_M  (PCR_TG0_WDT_CLK_SEL_V << PCR_TG0_WDT_CLK_SEL_S)
#define PCR_TG0_WDT_CLK_SEL_V  0x00000003
#define PCR_TG0_WDT_CLK_SEL_S  20

/* PCR_TIMERGROUP1_CONF_REG register
 * TIMERGROUP1 configuration register
 */

#define PCR_TIMERGROUP1_CONF_REG (DR_REG_PCR_BASE + 0x48)

/* PCR_TG1_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset timer_group1 module
 */

#define PCR_TG1_RST_EN    (BIT(1))
#define PCR_TG1_RST_EN_M  (PCR_TG1_RST_EN_V << PCR_TG1_RST_EN_S)
#define PCR_TG1_RST_EN_V  0x00000001
#define PCR_TG1_RST_EN_S  1

/* PCR_TG1_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable timer_group1 apb clock
 */

#define PCR_TG1_CLK_EN    (BIT(0))
#define PCR_TG1_CLK_EN_M  (PCR_TG1_CLK_EN_V << PCR_TG1_CLK_EN_S)
#define PCR_TG1_CLK_EN_V  0x00000001
#define PCR_TG1_CLK_EN_S  0

/* PCR_TIMERGROUP1_TIMER_CLK_CONF_REG register
 * TIMERGROUP1_TIMER_CLK configuration register
 */

#define PCR_TIMERGROUP1_TIMER_CLK_CONF_REG (DR_REG_PCR_BASE + 0x4c)

/* PCR_TG1_TIMER_CLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable timer_group1 timer clock
 */

#define PCR_TG1_TIMER_CLK_EN    (BIT(22))
#define PCR_TG1_TIMER_CLK_EN_M  (PCR_TG1_TIMER_CLK_EN_V << PCR_TG1_TIMER_CLK_EN_S)
#define PCR_TG1_TIMER_CLK_EN_V  0x00000001
#define PCR_TG1_TIMER_CLK_EN_S  22

/* PCR_TG1_TIMER_CLK_SEL : R/W; bitpos: [21:20]; default: 0;
 * set this field to select clock-source. 0(default): XTAL, 1: 80MHz, 2:
 * FOSC, 3: reserved.
 */

#define PCR_TG1_TIMER_CLK_SEL    0x00000003
#define PCR_TG1_TIMER_CLK_SEL_M  (PCR_TG1_TIMER_CLK_SEL_V << PCR_TG1_TIMER_CLK_SEL_S)
#define PCR_TG1_TIMER_CLK_SEL_V  0x00000003
#define PCR_TG1_TIMER_CLK_SEL_S  20

/* PCR_TIMERGROUP1_WDT_CLK_CONF_REG register
 * TIMERGROUP1_WDT_CLK configuration register
 */

#define PCR_TIMERGROUP1_WDT_CLK_CONF_REG (DR_REG_PCR_BASE + 0x50)

/* PCR_TG1_WDT_CLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable timer_group0 wdt clock
 */

#define PCR_TG1_WDT_CLK_EN    (BIT(22))
#define PCR_TG1_WDT_CLK_EN_M  (PCR_TG1_WDT_CLK_EN_V << PCR_TG1_WDT_CLK_EN_S)
#define PCR_TG1_WDT_CLK_EN_V  0x00000001
#define PCR_TG1_WDT_CLK_EN_S  22

/* PCR_TG1_WDT_CLK_SEL : R/W; bitpos: [21:20]; default: 0;
 * set this field to select clock-source. 0(default): XTAL, 1: 80MHz, 2:
 * FOSC, 3: reserved.
 */

#define PCR_TG1_WDT_CLK_SEL    0x00000003
#define PCR_TG1_WDT_CLK_SEL_M  (PCR_TG1_WDT_CLK_SEL_V << PCR_TG1_WDT_CLK_SEL_S)
#define PCR_TG1_WDT_CLK_SEL_V  0x00000003
#define PCR_TG1_WDT_CLK_SEL_S  20

/* PCR_SYSTIMER_CONF_REG register
 * SYSTIMER configuration register
 */

#define PCR_SYSTIMER_CONF_REG (DR_REG_PCR_BASE + 0x54)

/* PCR_SYSTIMER_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset systimer module
 */

#define PCR_SYSTIMER_RST_EN    (BIT(1))
#define PCR_SYSTIMER_RST_EN_M  (PCR_SYSTIMER_RST_EN_V << PCR_SYSTIMER_RST_EN_S)
#define PCR_SYSTIMER_RST_EN_V  0x00000001
#define PCR_SYSTIMER_RST_EN_S  1

/* PCR_SYSTIMER_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable systimer apb clock
 */

#define PCR_SYSTIMER_CLK_EN    (BIT(0))
#define PCR_SYSTIMER_CLK_EN_M  (PCR_SYSTIMER_CLK_EN_V << PCR_SYSTIMER_CLK_EN_S)
#define PCR_SYSTIMER_CLK_EN_V  0x00000001
#define PCR_SYSTIMER_CLK_EN_S  0

/* PCR_SYSTIMER_FUNC_CLK_CONF_REG register
 * SYSTIMER_FUNC_CLK configuration register
 */

#define PCR_SYSTIMER_FUNC_CLK_CONF_REG (DR_REG_PCR_BASE + 0x58)

/* PCR_SYSTIMER_FUNC_CLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable systimer function clock
 */

#define PCR_SYSTIMER_FUNC_CLK_EN    (BIT(22))
#define PCR_SYSTIMER_FUNC_CLK_EN_M  (PCR_SYSTIMER_FUNC_CLK_EN_V << PCR_SYSTIMER_FUNC_CLK_EN_S)
#define PCR_SYSTIMER_FUNC_CLK_EN_V  0x00000001
#define PCR_SYSTIMER_FUNC_CLK_EN_S  22

/* PCR_SYSTIMER_FUNC_CLK_SEL : R/W; bitpos: [20]; default: 0;
 * set this field to select clock-source. 0(default): XTAL, 1: FOSC.
 */

#define PCR_SYSTIMER_FUNC_CLK_SEL    (BIT(20))
#define PCR_SYSTIMER_FUNC_CLK_SEL_M  (PCR_SYSTIMER_FUNC_CLK_SEL_V << PCR_SYSTIMER_FUNC_CLK_SEL_S)
#define PCR_SYSTIMER_FUNC_CLK_SEL_V  0x00000001
#define PCR_SYSTIMER_FUNC_CLK_SEL_S  20

/* PCR_TWAI0_CONF_REG register
 * TWAI0 configuration register
 */

#define PCR_TWAI0_CONF_REG (DR_REG_PCR_BASE + 0x5c)

/* PCR_TWAI0_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset twai0 module
 */

#define PCR_TWAI0_RST_EN    (BIT(1))
#define PCR_TWAI0_RST_EN_M  (PCR_TWAI0_RST_EN_V << PCR_TWAI0_RST_EN_S)
#define PCR_TWAI0_RST_EN_V  0x00000001
#define PCR_TWAI0_RST_EN_S  1

/* PCR_TWAI0_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable twai0 apb clock
 */

#define PCR_TWAI0_CLK_EN    (BIT(0))
#define PCR_TWAI0_CLK_EN_M  (PCR_TWAI0_CLK_EN_V << PCR_TWAI0_CLK_EN_S)
#define PCR_TWAI0_CLK_EN_V  0x00000001
#define PCR_TWAI0_CLK_EN_S  0

/* PCR_TWAI0_FUNC_CLK_CONF_REG register
 * TWAI0_FUNC_CLK configuration register
 */

#define PCR_TWAI0_FUNC_CLK_CONF_REG (DR_REG_PCR_BASE + 0x60)

/* PCR_TWAI0_FUNC_CLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable twai0 function clock
 */

#define PCR_TWAI0_FUNC_CLK_EN    (BIT(22))
#define PCR_TWAI0_FUNC_CLK_EN_M  (PCR_TWAI0_FUNC_CLK_EN_V << PCR_TWAI0_FUNC_CLK_EN_S)
#define PCR_TWAI0_FUNC_CLK_EN_V  0x00000001
#define PCR_TWAI0_FUNC_CLK_EN_S  22

/* PCR_TWAI0_FUNC_CLK_SEL : R/W; bitpos: [20]; default: 0;
 * set this field to select clock-source. 0(default): XTAL, 1: FOSC.
 */

#define PCR_TWAI0_FUNC_CLK_SEL    (BIT(20))
#define PCR_TWAI0_FUNC_CLK_SEL_M  (PCR_TWAI0_FUNC_CLK_SEL_V << PCR_TWAI0_FUNC_CLK_SEL_S)
#define PCR_TWAI0_FUNC_CLK_SEL_V  0x00000001
#define PCR_TWAI0_FUNC_CLK_SEL_S  20

/* PCR_TWAI1_CONF_REG register
 * TWAI1 configuration register
 */

#define PCR_TWAI1_CONF_REG (DR_REG_PCR_BASE + 0x64)

/* PCR_TWAI1_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset twai1 module
 */

#define PCR_TWAI1_RST_EN    (BIT(1))
#define PCR_TWAI1_RST_EN_M  (PCR_TWAI1_RST_EN_V << PCR_TWAI1_RST_EN_S)
#define PCR_TWAI1_RST_EN_V  0x00000001
#define PCR_TWAI1_RST_EN_S  1

