apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_pcr.h
/* PCR_TWAI1_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable twai1 apb clock
 */

#define PCR_TWAI1_CLK_EN    (BIT(0))
#define PCR_TWAI1_CLK_EN_M  (PCR_TWAI1_CLK_EN_V << PCR_TWAI1_CLK_EN_S)
#define PCR_TWAI1_CLK_EN_V  0x00000001
#define PCR_TWAI1_CLK_EN_S  0

/* PCR_TWAI1_FUNC_CLK_CONF_REG register
 * TWAI1_FUNC_CLK configuration register
 */

#define PCR_TWAI1_FUNC_CLK_CONF_REG (DR_REG_PCR_BASE + 0x68)

/* PCR_TWAI1_FUNC_CLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable twai1 function clock
 */

#define PCR_TWAI1_FUNC_CLK_EN    (BIT(22))
#define PCR_TWAI1_FUNC_CLK_EN_M  (PCR_TWAI1_FUNC_CLK_EN_V << PCR_TWAI1_FUNC_CLK_EN_S)
#define PCR_TWAI1_FUNC_CLK_EN_V  0x00000001
#define PCR_TWAI1_FUNC_CLK_EN_S  22

/* PCR_TWAI1_FUNC_CLK_SEL : R/W; bitpos: [20]; default: 0;
 * set this field to select clock-source. 0(default): XTAL, 1: FOSC.
 */

#define PCR_TWAI1_FUNC_CLK_SEL    (BIT(20))
#define PCR_TWAI1_FUNC_CLK_SEL_M  (PCR_TWAI1_FUNC_CLK_SEL_V << PCR_TWAI1_FUNC_CLK_SEL_S)
#define PCR_TWAI1_FUNC_CLK_SEL_V  0x00000001
#define PCR_TWAI1_FUNC_CLK_SEL_S  20

/* PCR_I2S_CONF_REG register
 * I2S configuration register
 */

#define PCR_I2S_CONF_REG (DR_REG_PCR_BASE + 0x6c)

/* PCR_I2S_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset i2s module
 */

#define PCR_I2S_RST_EN    (BIT(1))
#define PCR_I2S_RST_EN_M  (PCR_I2S_RST_EN_V << PCR_I2S_RST_EN_S)
#define PCR_I2S_RST_EN_V  0x00000001
#define PCR_I2S_RST_EN_S  1

/* PCR_I2S_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable i2s apb clock
 */

#define PCR_I2S_CLK_EN    (BIT(0))
#define PCR_I2S_CLK_EN_M  (PCR_I2S_CLK_EN_V << PCR_I2S_CLK_EN_S)
#define PCR_I2S_CLK_EN_V  0x00000001
#define PCR_I2S_CLK_EN_S  0

/* PCR_I2S_TX_CLKM_CONF_REG register
 * I2S_TX_CLKM configuration register
 */

#define PCR_I2S_TX_CLKM_CONF_REG (DR_REG_PCR_BASE + 0x70)

/* PCR_I2S_TX_CLKM_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable i2s_tx function clock
 */

#define PCR_I2S_TX_CLKM_EN    (BIT(22))
#define PCR_I2S_TX_CLKM_EN_M  (PCR_I2S_TX_CLKM_EN_V << PCR_I2S_TX_CLKM_EN_S)
#define PCR_I2S_TX_CLKM_EN_V  0x00000001
#define PCR_I2S_TX_CLKM_EN_S  22

/* PCR_I2S_TX_CLKM_SEL : R/W; bitpos: [21:20]; default: 0;
 * Select I2S Tx module source clock. 0: XTAL clock. 1: APLL. 2: CLK160. 3:
 * I2S_MCLK_in.
 */

#define PCR_I2S_TX_CLKM_SEL    0x00000003
#define PCR_I2S_TX_CLKM_SEL_M  (PCR_I2S_TX_CLKM_SEL_V << PCR_I2S_TX_CLKM_SEL_S)
#define PCR_I2S_TX_CLKM_SEL_V  0x00000003
#define PCR_I2S_TX_CLKM_SEL_S  20

/* PCR_I2S_TX_CLKM_DIV_NUM : R/W; bitpos: [19:12]; default: 2;
 * Integral I2S TX clock divider value. f_I2S_CLK = f_I2S_CLK_S/(N+b/a).
 * There will be (a-b) * n-div and b * (n+1)-div.  So the average
 * combination will be:  for b <= a/2, z * [x * n-div + (n+1)-div] + y *
 * n-div. For b > a/2, z * [n-div + x * (n+1)-div] + y * (n+1)-div.
 */

#define PCR_I2S_TX_CLKM_DIV_NUM    0x000000ff
#define PCR_I2S_TX_CLKM_DIV_NUM_M  (PCR_I2S_TX_CLKM_DIV_NUM_V << PCR_I2S_TX_CLKM_DIV_NUM_S)
#define PCR_I2S_TX_CLKM_DIV_NUM_V  0x000000ff
#define PCR_I2S_TX_CLKM_DIV_NUM_S  12

/* PCR_I2S_TX_CLKM_DIV_CONF_REG register
 * I2S_TX_CLKM_DIV configuration register
 */

#define PCR_I2S_TX_CLKM_DIV_CONF_REG (DR_REG_PCR_BASE + 0x74)

/* PCR_I2S_TX_CLKM_DIV_YN1 : R/W; bitpos: [27]; default: 0;
 * For b <= a/2, the value of I2S_TX_CLKM_DIV_YN1 is 0 . For b > a/2, the
 * value of I2S_TX_CLKM_DIV_YN1 is 1.
 */

#define PCR_I2S_TX_CLKM_DIV_YN1    (BIT(27))
#define PCR_I2S_TX_CLKM_DIV_YN1_M  (PCR_I2S_TX_CLKM_DIV_YN1_V << PCR_I2S_TX_CLKM_DIV_YN1_S)
#define PCR_I2S_TX_CLKM_DIV_YN1_V  0x00000001
#define PCR_I2S_TX_CLKM_DIV_YN1_S  27

/* PCR_I2S_TX_CLKM_DIV_X : R/W; bitpos: [26:18]; default: 0;
 * For b <= a/2, the value of I2S_TX_CLKM_DIV_X is (a/b) - 1. For b > a/2,
 * the value of I2S_TX_CLKM_DIV_X is (a/(a-b)) - 1.
 */

#define PCR_I2S_TX_CLKM_DIV_X    0x000001ff
#define PCR_I2S_TX_CLKM_DIV_X_M  (PCR_I2S_TX_CLKM_DIV_X_V << PCR_I2S_TX_CLKM_DIV_X_S)
#define PCR_I2S_TX_CLKM_DIV_X_V  0x000001ff
#define PCR_I2S_TX_CLKM_DIV_X_S  18

/* PCR_I2S_TX_CLKM_DIV_Y : R/W; bitpos: [17:9]; default: 1;
 * For b <= a/2, the value of I2S_TX_CLKM_DIV_Y is (a%b) . For b > a/2, the
 * value of I2S_TX_CLKM_DIV_Y is (a%(a-b)).
 */

#define PCR_I2S_TX_CLKM_DIV_Y    0x000001ff
#define PCR_I2S_TX_CLKM_DIV_Y_M  (PCR_I2S_TX_CLKM_DIV_Y_V << PCR_I2S_TX_CLKM_DIV_Y_S)
#define PCR_I2S_TX_CLKM_DIV_Y_V  0x000001ff
#define PCR_I2S_TX_CLKM_DIV_Y_S  9

/* PCR_I2S_TX_CLKM_DIV_Z : R/W; bitpos: [8:0]; default: 0;
 * For b <= a/2, the value of I2S_TX_CLKM_DIV_Z is b. For b > a/2, the value
 * of I2S_TX_CLKM_DIV_Z is (a-b).
 */

#define PCR_I2S_TX_CLKM_DIV_Z    0x000001ff
#define PCR_I2S_TX_CLKM_DIV_Z_M  (PCR_I2S_TX_CLKM_DIV_Z_V << PCR_I2S_TX_CLKM_DIV_Z_S)
#define PCR_I2S_TX_CLKM_DIV_Z_V  0x000001ff
#define PCR_I2S_TX_CLKM_DIV_Z_S  0

/* PCR_I2S_RX_CLKM_CONF_REG register
 * I2S_RX_CLKM configuration register
 */

#define PCR_I2S_RX_CLKM_CONF_REG (DR_REG_PCR_BASE + 0x78)

/* PCR_I2S_MCLK_SEL : R/W; bitpos: [23]; default: 0;
 * This field is used to select master-clock. 0(default): clk_i2s_rx, 1:
 * clk_i2s_tx
 */

#define PCR_I2S_MCLK_SEL    (BIT(23))
#define PCR_I2S_MCLK_SEL_M  (PCR_I2S_MCLK_SEL_V << PCR_I2S_MCLK_SEL_S)
#define PCR_I2S_MCLK_SEL_V  0x00000001
#define PCR_I2S_MCLK_SEL_S  23

/* PCR_I2S_RX_CLKM_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable i2s_rx function clock
 */

#define PCR_I2S_RX_CLKM_EN    (BIT(22))
#define PCR_I2S_RX_CLKM_EN_M  (PCR_I2S_RX_CLKM_EN_V << PCR_I2S_RX_CLKM_EN_S)
#define PCR_I2S_RX_CLKM_EN_V  0x00000001
#define PCR_I2S_RX_CLKM_EN_S  22

/* PCR_I2S_RX_CLKM_SEL : R/W; bitpos: [21:20]; default: 0;
 * Select I2S Rx module source clock. 0: no clock. 1: APLL. 2: CLK160. 3:
 * I2S_MCLK_in.
 */

#define PCR_I2S_RX_CLKM_SEL    0x00000003
#define PCR_I2S_RX_CLKM_SEL_M  (PCR_I2S_RX_CLKM_SEL_V << PCR_I2S_RX_CLKM_SEL_S)
#define PCR_I2S_RX_CLKM_SEL_V  0x00000003
#define PCR_I2S_RX_CLKM_SEL_S  20

/* PCR_I2S_RX_CLKM_DIV_NUM : R/W; bitpos: [19:12]; default: 2;
 * Integral I2S clock divider value
 */

#define PCR_I2S_RX_CLKM_DIV_NUM    0x000000ff
#define PCR_I2S_RX_CLKM_DIV_NUM_M  (PCR_I2S_RX_CLKM_DIV_NUM_V << PCR_I2S_RX_CLKM_DIV_NUM_S)
#define PCR_I2S_RX_CLKM_DIV_NUM_V  0x000000ff
#define PCR_I2S_RX_CLKM_DIV_NUM_S  12

/* PCR_I2S_RX_CLKM_DIV_CONF_REG register
 * I2S_RX_CLKM_DIV configuration register
 */

