apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_pcr.h
#define PCR_USB_DEVICE_RST_EN    (BIT(1))
#define PCR_USB_DEVICE_RST_EN_M  (PCR_USB_DEVICE_RST_EN_V << PCR_USB_DEVICE_RST_EN_S)
#define PCR_USB_DEVICE_RST_EN_V  0x00000001
#define PCR_USB_DEVICE_RST_EN_S  1

/* PCR_USB_DEVICE_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable usb_device clock
 */

#define PCR_USB_DEVICE_CLK_EN    (BIT(0))
#define PCR_USB_DEVICE_CLK_EN_M  (PCR_USB_DEVICE_CLK_EN_V << PCR_USB_DEVICE_CLK_EN_S)
#define PCR_USB_DEVICE_CLK_EN_V  0x00000001
#define PCR_USB_DEVICE_CLK_EN_S  0

/* PCR_INTMTX_CONF_REG register
 * INTMTX configuration register
 */

#define PCR_INTMTX_CONF_REG (DR_REG_PCR_BASE + 0x90)

/* PCR_INTMTX_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset intmtx module
 */

#define PCR_INTMTX_RST_EN    (BIT(1))
#define PCR_INTMTX_RST_EN_M  (PCR_INTMTX_RST_EN_V << PCR_INTMTX_RST_EN_S)
#define PCR_INTMTX_RST_EN_V  0x00000001
#define PCR_INTMTX_RST_EN_S  1

/* PCR_INTMTX_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable intmtx clock
 */

#define PCR_INTMTX_CLK_EN    (BIT(0))
#define PCR_INTMTX_CLK_EN_M  (PCR_INTMTX_CLK_EN_V << PCR_INTMTX_CLK_EN_S)
#define PCR_INTMTX_CLK_EN_V  0x00000001
#define PCR_INTMTX_CLK_EN_S  0

/* PCR_PCNT_CONF_REG register
 * PCNT configuration register
 */

#define PCR_PCNT_CONF_REG (DR_REG_PCR_BASE + 0x94)

/* PCR_PCNT_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset pcnt module
 */

#define PCR_PCNT_RST_EN    (BIT(1))
#define PCR_PCNT_RST_EN_M  (PCR_PCNT_RST_EN_V << PCR_PCNT_RST_EN_S)
#define PCR_PCNT_RST_EN_V  0x00000001
#define PCR_PCNT_RST_EN_S  1

/* PCR_PCNT_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable pcnt clock
 */

#define PCR_PCNT_CLK_EN    (BIT(0))
#define PCR_PCNT_CLK_EN_M  (PCR_PCNT_CLK_EN_V << PCR_PCNT_CLK_EN_S)
#define PCR_PCNT_CLK_EN_V  0x00000001
#define PCR_PCNT_CLK_EN_S  0

/* PCR_ETM_CONF_REG register
 * ETM configuration register
 */

#define PCR_ETM_CONF_REG (DR_REG_PCR_BASE + 0x98)

/* PCR_ETM_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset etm module
 */

#define PCR_ETM_RST_EN    (BIT(1))
#define PCR_ETM_RST_EN_M  (PCR_ETM_RST_EN_V << PCR_ETM_RST_EN_S)
#define PCR_ETM_RST_EN_V  0x00000001
#define PCR_ETM_RST_EN_S  1

/* PCR_ETM_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable etm clock
 */

#define PCR_ETM_CLK_EN    (BIT(0))
#define PCR_ETM_CLK_EN_M  (PCR_ETM_CLK_EN_V << PCR_ETM_CLK_EN_S)
#define PCR_ETM_CLK_EN_V  0x00000001
#define PCR_ETM_CLK_EN_S  0

/* PCR_PWM_CONF_REG register
 * PWM configuration register
 */

#define PCR_PWM_CONF_REG (DR_REG_PCR_BASE + 0x9c)

/* PCR_PWM_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset pwm module
 */

#define PCR_PWM_RST_EN    (BIT(1))
#define PCR_PWM_RST_EN_M  (PCR_PWM_RST_EN_V << PCR_PWM_RST_EN_S)
#define PCR_PWM_RST_EN_V  0x00000001
#define PCR_PWM_RST_EN_S  1

/* PCR_PWM_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable pwm clock
 */

#define PCR_PWM_CLK_EN    (BIT(0))
#define PCR_PWM_CLK_EN_M  (PCR_PWM_CLK_EN_V << PCR_PWM_CLK_EN_S)
#define PCR_PWM_CLK_EN_V  0x00000001
#define PCR_PWM_CLK_EN_S  0

/* PCR_PWM_CLK_CONF_REG register
 * PWM_CLK configuration register
 */

#define PCR_PWM_CLK_CONF_REG (DR_REG_PCR_BASE + 0xa0)

/* PCR_PWM_CLKM_EN : R/W; bitpos: [22]; default: 1;
 * set this field as 1 to activate pwm clkm.
 */

#define PCR_PWM_CLKM_EN    (BIT(22))
#define PCR_PWM_CLKM_EN_M  (PCR_PWM_CLKM_EN_V << PCR_PWM_CLKM_EN_S)
#define PCR_PWM_CLKM_EN_V  0x00000001
#define PCR_PWM_CLKM_EN_S  22

/* PCR_PWM_CLKM_SEL : R/W; bitpos: [21:20]; default: 0;
 * set this field to select clock-source. 0(default): do not select anyone
 * clock, 1: 160MHz, 2: XTAL, 3: FOSC.
 */

#define PCR_PWM_CLKM_SEL    0x00000003
#define PCR_PWM_CLKM_SEL_M  (PCR_PWM_CLKM_SEL_V << PCR_PWM_CLKM_SEL_S)
#define PCR_PWM_CLKM_SEL_V  0x00000003
#define PCR_PWM_CLKM_SEL_S  20

/* PCR_PWM_DIV_NUM : R/W; bitpos: [19:12]; default: 4;
 * The integral part of the frequency divider factor of the pwm function
 * clock.
 */

#define PCR_PWM_DIV_NUM    0x000000ff
#define PCR_PWM_DIV_NUM_M  (PCR_PWM_DIV_NUM_V << PCR_PWM_DIV_NUM_S)
#define PCR_PWM_DIV_NUM_V  0x000000ff
#define PCR_PWM_DIV_NUM_S  12

/* PCR_PARL_IO_CONF_REG register
 * PARL_IO configuration register
 */

#define PCR_PARL_IO_CONF_REG (DR_REG_PCR_BASE + 0xa4)

/* PCR_PARL_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset parl apb reg
 */

#define PCR_PARL_RST_EN    (BIT(1))
#define PCR_PARL_RST_EN_M  (PCR_PARL_RST_EN_V << PCR_PARL_RST_EN_S)
#define PCR_PARL_RST_EN_V  0x00000001
#define PCR_PARL_RST_EN_S  1

/* PCR_PARL_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable parl apb clock
 */

#define PCR_PARL_CLK_EN    (BIT(0))
#define PCR_PARL_CLK_EN_M  (PCR_PARL_CLK_EN_V << PCR_PARL_CLK_EN_S)
#define PCR_PARL_CLK_EN_V  0x00000001
#define PCR_PARL_CLK_EN_S  0

/* PCR_PARL_CLK_RX_CONF_REG register
 * PARL_CLK_RX configuration register
 */

#define PCR_PARL_CLK_RX_CONF_REG (DR_REG_PCR_BASE + 0xa8)

/* PCR_PARL_RX_RST_EN : R/W; bitpos: [19]; default: 0;
 * Set 0 to reset parl rx module
 */

#define PCR_PARL_RX_RST_EN    (BIT(19))
#define PCR_PARL_RX_RST_EN_M  (PCR_PARL_RX_RST_EN_V << PCR_PARL_RX_RST_EN_S)
#define PCR_PARL_RX_RST_EN_V  0x00000001
#define PCR_PARL_RX_RST_EN_S  19

/* PCR_PARL_CLK_RX_EN : R/W; bitpos: [18]; default: 1;
 * Set 1 to enable parl rx clock
 */

#define PCR_PARL_CLK_RX_EN    (BIT(18))
#define PCR_PARL_CLK_RX_EN_M  (PCR_PARL_CLK_RX_EN_V << PCR_PARL_CLK_RX_EN_S)
#define PCR_PARL_CLK_RX_EN_V  0x00000001
#define PCR_PARL_CLK_RX_EN_S  18

/* PCR_PARL_CLK_RX_SEL : R/W; bitpos: [17:16]; default: 0;
 * set this field to select clock-source. 0(default): XTAL, 1: 240MHz, 2:
 * FOSC, 3: user clock from pad.
 */

#define PCR_PARL_CLK_RX_SEL    0x00000003
#define PCR_PARL_CLK_RX_SEL_M  (PCR_PARL_CLK_RX_SEL_V << PCR_PARL_CLK_RX_SEL_S)
#define PCR_PARL_CLK_RX_SEL_V  0x00000003
#define PCR_PARL_CLK_RX_SEL_S  16

/* PCR_PARL_CLK_RX_DIV_NUM : R/W; bitpos: [15:0]; default: 0;
 * The integral part of the frequency divider factor of the parl rx clock.
 */

#define PCR_PARL_CLK_RX_DIV_NUM    0x0000ffff
#define PCR_PARL_CLK_RX_DIV_NUM_M  (PCR_PARL_CLK_RX_DIV_NUM_V << PCR_PARL_CLK_RX_DIV_NUM_S)
#define PCR_PARL_CLK_RX_DIV_NUM_V  0x0000ffff
#define PCR_PARL_CLK_RX_DIV_NUM_S  0

/* PCR_PARL_CLK_TX_CONF_REG register
 * PARL_CLK_TX configuration register
 */

