apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_pcr.h
#define PCR_PARL_CLK_TX_CONF_REG (DR_REG_PCR_BASE + 0xac)

/* PCR_PARL_TX_RST_EN : R/W; bitpos: [19]; default: 0;
 * Set 0 to reset parl tx module
 */

#define PCR_PARL_TX_RST_EN    (BIT(19))
#define PCR_PARL_TX_RST_EN_M  (PCR_PARL_TX_RST_EN_V << PCR_PARL_TX_RST_EN_S)
#define PCR_PARL_TX_RST_EN_V  0x00000001
#define PCR_PARL_TX_RST_EN_S  19

/* PCR_PARL_CLK_TX_EN : R/W; bitpos: [18]; default: 1;
 * Set 1 to enable parl tx clock
 */

#define PCR_PARL_CLK_TX_EN    (BIT(18))
#define PCR_PARL_CLK_TX_EN_M  (PCR_PARL_CLK_TX_EN_V << PCR_PARL_CLK_TX_EN_S)
#define PCR_PARL_CLK_TX_EN_V  0x00000001
#define PCR_PARL_CLK_TX_EN_S  18

/* PCR_PARL_CLK_TX_SEL : R/W; bitpos: [17:16]; default: 0;
 * set this field to select clock-source. 0(default): XTAL, 1: 240MHz, 2:
 * FOSC, 3: user clock from pad.
 */

#define PCR_PARL_CLK_TX_SEL    0x00000003
#define PCR_PARL_CLK_TX_SEL_M  (PCR_PARL_CLK_TX_SEL_V << PCR_PARL_CLK_TX_SEL_S)
#define PCR_PARL_CLK_TX_SEL_V  0x00000003
#define PCR_PARL_CLK_TX_SEL_S  16

/* PCR_PARL_CLK_TX_DIV_NUM : R/W; bitpos: [15:0]; default: 0;
 * The integral part of the frequency divider factor of the parl tx clock.
 */

#define PCR_PARL_CLK_TX_DIV_NUM    0x0000ffff
#define PCR_PARL_CLK_TX_DIV_NUM_M  (PCR_PARL_CLK_TX_DIV_NUM_V << PCR_PARL_CLK_TX_DIV_NUM_S)
#define PCR_PARL_CLK_TX_DIV_NUM_V  0x0000ffff
#define PCR_PARL_CLK_TX_DIV_NUM_S  0

/* PCR_SDIO_SLAVE_CONF_REG register
 * SDIO_SLAVE configuration register
 */

#define PCR_SDIO_SLAVE_CONF_REG (DR_REG_PCR_BASE + 0xb0)

/* PCR_SDIO_SLAVE_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset sdio_slave module
 */

#define PCR_SDIO_SLAVE_RST_EN    (BIT(1))
#define PCR_SDIO_SLAVE_RST_EN_M  (PCR_SDIO_SLAVE_RST_EN_V << PCR_SDIO_SLAVE_RST_EN_S)
#define PCR_SDIO_SLAVE_RST_EN_V  0x00000001
#define PCR_SDIO_SLAVE_RST_EN_S  1

/* PCR_SDIO_SLAVE_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable sdio_slave clock
 */

#define PCR_SDIO_SLAVE_CLK_EN    (BIT(0))
#define PCR_SDIO_SLAVE_CLK_EN_M  (PCR_SDIO_SLAVE_CLK_EN_V << PCR_SDIO_SLAVE_CLK_EN_S)
#define PCR_SDIO_SLAVE_CLK_EN_V  0x00000001
#define PCR_SDIO_SLAVE_CLK_EN_S  0

/* PCR_PVT_MONITOR_CONF_REG register
 * PVT_MONITOR configuration register
 */

#define PCR_PVT_MONITOR_CONF_REG (DR_REG_PCR_BASE + 0xb4)

/* PCR_PVT_MONITOR_SITE3_CLK_EN : R/W; bitpos: [4]; default: 1;
 * Set 1 to enable function clock of hp_peri pvt module
 */

#define PCR_PVT_MONITOR_SITE3_CLK_EN    (BIT(4))
#define PCR_PVT_MONITOR_SITE3_CLK_EN_M  (PCR_PVT_MONITOR_SITE3_CLK_EN_V << PCR_PVT_MONITOR_SITE3_CLK_EN_S)
#define PCR_PVT_MONITOR_SITE3_CLK_EN_V  0x00000001
#define PCR_PVT_MONITOR_SITE3_CLK_EN_S  4

/* PCR_PVT_MONITOR_SITE2_CLK_EN : R/W; bitpos: [3]; default: 1;
 * Set 1 to enable function clock of cpu pvt module
 */

#define PCR_PVT_MONITOR_SITE2_CLK_EN    (BIT(3))
#define PCR_PVT_MONITOR_SITE2_CLK_EN_M  (PCR_PVT_MONITOR_SITE2_CLK_EN_V << PCR_PVT_MONITOR_SITE2_CLK_EN_S)
#define PCR_PVT_MONITOR_SITE2_CLK_EN_V  0x00000001
#define PCR_PVT_MONITOR_SITE2_CLK_EN_S  3

/* PCR_PVT_MONITOR_SITE1_CLK_EN : R/W; bitpos: [2]; default: 1;
 * Set 1 to enable function clock of modem pvt module
 */

#define PCR_PVT_MONITOR_SITE1_CLK_EN    (BIT(2))
#define PCR_PVT_MONITOR_SITE1_CLK_EN_M  (PCR_PVT_MONITOR_SITE1_CLK_EN_V << PCR_PVT_MONITOR_SITE1_CLK_EN_S)
#define PCR_PVT_MONITOR_SITE1_CLK_EN_V  0x00000001
#define PCR_PVT_MONITOR_SITE1_CLK_EN_S  2

/* PCR_PVT_MONITOR_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset all pvt monitor module
 */

#define PCR_PVT_MONITOR_RST_EN    (BIT(1))
#define PCR_PVT_MONITOR_RST_EN_M  (PCR_PVT_MONITOR_RST_EN_V << PCR_PVT_MONITOR_RST_EN_S)
#define PCR_PVT_MONITOR_RST_EN_V  0x00000001
#define PCR_PVT_MONITOR_RST_EN_S  1

/* PCR_PVT_MONITOR_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable apb clock of pvt module
 */

#define PCR_PVT_MONITOR_CLK_EN    (BIT(0))
#define PCR_PVT_MONITOR_CLK_EN_M  (PCR_PVT_MONITOR_CLK_EN_V << PCR_PVT_MONITOR_CLK_EN_S)
#define PCR_PVT_MONITOR_CLK_EN_V  0x00000001
#define PCR_PVT_MONITOR_CLK_EN_S  0

/* PCR_PVT_MONITOR_FUNC_CLK_CONF_REG register
 * PVT_MONITOR function clock configuration register
 */

#define PCR_PVT_MONITOR_FUNC_CLK_CONF_REG (DR_REG_PCR_BASE + 0xb8)

/* PCR_PVT_MONITOR_FUNC_CLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable source clock of pvt sitex
 */

#define PCR_PVT_MONITOR_FUNC_CLK_EN    (BIT(22))
#define PCR_PVT_MONITOR_FUNC_CLK_EN_M  (PCR_PVT_MONITOR_FUNC_CLK_EN_V << PCR_PVT_MONITOR_FUNC_CLK_EN_S)
#define PCR_PVT_MONITOR_FUNC_CLK_EN_V  0x00000001
#define PCR_PVT_MONITOR_FUNC_CLK_EN_S  22

/* PCR_PVT_MONITOR_FUNC_CLK_SEL : R/W; bitpos: [20]; default: 0;
 * set this field to select clock-source. 0: XTAL, 1(default): 160MHz drived
 * by SPLL divided by 3.
 */

#define PCR_PVT_MONITOR_FUNC_CLK_SEL    (BIT(20))
#define PCR_PVT_MONITOR_FUNC_CLK_SEL_M  (PCR_PVT_MONITOR_FUNC_CLK_SEL_V << PCR_PVT_MONITOR_FUNC_CLK_SEL_S)
#define PCR_PVT_MONITOR_FUNC_CLK_SEL_V  0x00000001
#define PCR_PVT_MONITOR_FUNC_CLK_SEL_S  20

/* PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM : R/W; bitpos: [3:0]; default: 0;
 * The integral part of the frequency divider factor of the pvt_monitor
 * function clock.
 */

#define PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM    0x0000000f
#define PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_M  (PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_V << PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_S)
#define PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_V  0x0000000f
#define PCR_PVT_MONITOR_FUNC_CLK_DIV_NUM_S  0

/* PCR_GDMA_CONF_REG register
 * GDMA configuration register
 */

#define PCR_GDMA_CONF_REG (DR_REG_PCR_BASE + 0xbc)

/* PCR_GDMA_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset gdma module
 */

#define PCR_GDMA_RST_EN    (BIT(1))
#define PCR_GDMA_RST_EN_M  (PCR_GDMA_RST_EN_V << PCR_GDMA_RST_EN_S)
#define PCR_GDMA_RST_EN_V  0x00000001
#define PCR_GDMA_RST_EN_S  1

/* PCR_GDMA_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable gdma clock
 */

#define PCR_GDMA_CLK_EN    (BIT(0))
#define PCR_GDMA_CLK_EN_M  (PCR_GDMA_CLK_EN_V << PCR_GDMA_CLK_EN_S)
#define PCR_GDMA_CLK_EN_V  0x00000001
#define PCR_GDMA_CLK_EN_S  0

