apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_pcr.h
/* PCR_SPI2_CONF_REG register
 * SPI2 configuration register
 */

#define PCR_SPI2_CONF_REG (DR_REG_PCR_BASE + 0xc0)

/* PCR_SPI2_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset spi2 module
 */

#define PCR_SPI2_RST_EN    (BIT(1))
#define PCR_SPI2_RST_EN_M  (PCR_SPI2_RST_EN_V << PCR_SPI2_RST_EN_S)
#define PCR_SPI2_RST_EN_V  0x00000001
#define PCR_SPI2_RST_EN_S  1

/* PCR_SPI2_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable spi2 apb clock
 */

#define PCR_SPI2_CLK_EN    (BIT(0))
#define PCR_SPI2_CLK_EN_M  (PCR_SPI2_CLK_EN_V << PCR_SPI2_CLK_EN_S)
#define PCR_SPI2_CLK_EN_V  0x00000001
#define PCR_SPI2_CLK_EN_S  0

/* PCR_SPI2_CLKM_CONF_REG register
 * SPI2_CLKM configuration register
 */

#define PCR_SPI2_CLKM_CONF_REG (DR_REG_PCR_BASE + 0xc4)

/* PCR_SPI2_CLKM_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable spi2 function clock
 */

#define PCR_SPI2_CLKM_EN    (BIT(22))
#define PCR_SPI2_CLKM_EN_M  (PCR_SPI2_CLKM_EN_V << PCR_SPI2_CLKM_EN_S)
#define PCR_SPI2_CLKM_EN_V  0x00000001
#define PCR_SPI2_CLKM_EN_S  22

/* PCR_SPI2_CLKM_SEL : R/W; bitpos: [21:20]; default: 0;
 * set this field to select clock-source. 0(default): XTAL, 1: 80MHz, 2:
 * FOSC, 3: reserved.
 */

#define PCR_SPI2_CLKM_SEL    0x00000003
#define PCR_SPI2_CLKM_SEL_M  (PCR_SPI2_CLKM_SEL_V << PCR_SPI2_CLKM_SEL_S)
#define PCR_SPI2_CLKM_SEL_V  0x00000003
#define PCR_SPI2_CLKM_SEL_S  20

/* PCR_AES_CONF_REG register
 * AES configuration register
 */

#define PCR_AES_CONF_REG (DR_REG_PCR_BASE + 0xc8)

/* PCR_AES_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset aes module
 */

#define PCR_AES_RST_EN    (BIT(1))
#define PCR_AES_RST_EN_M  (PCR_AES_RST_EN_V << PCR_AES_RST_EN_S)
#define PCR_AES_RST_EN_V  0x00000001
#define PCR_AES_RST_EN_S  1

/* PCR_AES_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable aes clock
 */

#define PCR_AES_CLK_EN    (BIT(0))
#define PCR_AES_CLK_EN_M  (PCR_AES_CLK_EN_V << PCR_AES_CLK_EN_S)
#define PCR_AES_CLK_EN_V  0x00000001
#define PCR_AES_CLK_EN_S  0

/* PCR_SHA_CONF_REG register
 * SHA configuration register
 */

#define PCR_SHA_CONF_REG (DR_REG_PCR_BASE + 0xcc)

/* PCR_SHA_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset sha module
 */

#define PCR_SHA_RST_EN    (BIT(1))
#define PCR_SHA_RST_EN_M  (PCR_SHA_RST_EN_V << PCR_SHA_RST_EN_S)
#define PCR_SHA_RST_EN_V  0x00000001
#define PCR_SHA_RST_EN_S  1

/* PCR_SHA_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable sha clock
 */

#define PCR_SHA_CLK_EN    (BIT(0))
#define PCR_SHA_CLK_EN_M  (PCR_SHA_CLK_EN_V << PCR_SHA_CLK_EN_S)
#define PCR_SHA_CLK_EN_V  0x00000001
#define PCR_SHA_CLK_EN_S  0

/* PCR_RSA_CONF_REG register
 * RSA configuration register
 */

#define PCR_RSA_CONF_REG (DR_REG_PCR_BASE + 0xd0)

/* PCR_RSA_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset rsa module
 */

#define PCR_RSA_RST_EN    (BIT(1))
#define PCR_RSA_RST_EN_M  (PCR_RSA_RST_EN_V << PCR_RSA_RST_EN_S)
#define PCR_RSA_RST_EN_V  0x00000001
#define PCR_RSA_RST_EN_S  1

/* PCR_RSA_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable rsa clock
 */

#define PCR_RSA_CLK_EN    (BIT(0))
#define PCR_RSA_CLK_EN_M  (PCR_RSA_CLK_EN_V << PCR_RSA_CLK_EN_S)
#define PCR_RSA_CLK_EN_V  0x00000001
#define PCR_RSA_CLK_EN_S  0

/* PCR_RSA_PD_CTRL_REG register
 * RSA power control register
 */

#define PCR_RSA_PD_CTRL_REG (DR_REG_PCR_BASE + 0xd4)

/* PCR_RSA_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 * Set this bit to force power down rsa internal memory.
 */

#define PCR_RSA_MEM_FORCE_PD    (BIT(2))
#define PCR_RSA_MEM_FORCE_PD_M  (PCR_RSA_MEM_FORCE_PD_V << PCR_RSA_MEM_FORCE_PD_S)
#define PCR_RSA_MEM_FORCE_PD_V  0x00000001
#define PCR_RSA_MEM_FORCE_PD_S  2

/* PCR_RSA_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 * Set this bit to force power up rsa internal memory
 */

#define PCR_RSA_MEM_FORCE_PU    (BIT(1))
#define PCR_RSA_MEM_FORCE_PU_M  (PCR_RSA_MEM_FORCE_PU_V << PCR_RSA_MEM_FORCE_PU_S)
#define PCR_RSA_MEM_FORCE_PU_V  0x00000001
#define PCR_RSA_MEM_FORCE_PU_S  1

/* PCR_RSA_MEM_PD : R/W; bitpos: [0]; default: 0;
 * Set this bit to power down rsa internal memory.
 */

#define PCR_RSA_MEM_PD    (BIT(0))
#define PCR_RSA_MEM_PD_M  (PCR_RSA_MEM_PD_V << PCR_RSA_MEM_PD_S)
#define PCR_RSA_MEM_PD_V  0x00000001
#define PCR_RSA_MEM_PD_S  0

/* PCR_ECC_CONF_REG register
 * ECC configuration register
 */

#define PCR_ECC_CONF_REG (DR_REG_PCR_BASE + 0xd8)

/* PCR_ECC_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset ecc module
 */

#define PCR_ECC_RST_EN    (BIT(1))
#define PCR_ECC_RST_EN_M  (PCR_ECC_RST_EN_V << PCR_ECC_RST_EN_S)
#define PCR_ECC_RST_EN_V  0x00000001
#define PCR_ECC_RST_EN_S  1

/* PCR_ECC_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable ecc clock
 */

#define PCR_ECC_CLK_EN    (BIT(0))
#define PCR_ECC_CLK_EN_M  (PCR_ECC_CLK_EN_V << PCR_ECC_CLK_EN_S)
#define PCR_ECC_CLK_EN_V  0x00000001
#define PCR_ECC_CLK_EN_S  0

/* PCR_ECC_PD_CTRL_REG register
 * ECC power control register
 */

#define PCR_ECC_PD_CTRL_REG (DR_REG_PCR_BASE + 0xdc)

/* PCR_ECC_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 * Set this bit to force power down ecc internal memory.
 */

#define PCR_ECC_MEM_FORCE_PD    (BIT(2))
#define PCR_ECC_MEM_FORCE_PD_M  (PCR_ECC_MEM_FORCE_PD_V << PCR_ECC_MEM_FORCE_PD_S)
#define PCR_ECC_MEM_FORCE_PD_V  0x00000001
#define PCR_ECC_MEM_FORCE_PD_S  2

/* PCR_ECC_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 * Set this bit to force power up ecc internal memory
 */

#define PCR_ECC_MEM_FORCE_PU    (BIT(1))
#define PCR_ECC_MEM_FORCE_PU_M  (PCR_ECC_MEM_FORCE_PU_V << PCR_ECC_MEM_FORCE_PU_S)
#define PCR_ECC_MEM_FORCE_PU_V  0x00000001
#define PCR_ECC_MEM_FORCE_PU_S  1

/* PCR_ECC_MEM_PD : R/W; bitpos: [0]; default: 0;
 * Set this bit to power down ecc internal memory.
 */

#define PCR_ECC_MEM_PD    (BIT(0))
#define PCR_ECC_MEM_PD_M  (PCR_ECC_MEM_PD_V << PCR_ECC_MEM_PD_S)
#define PCR_ECC_MEM_PD_V  0x00000001
#define PCR_ECC_MEM_PD_S  0

/* PCR_DS_CONF_REG register
 * DS configuration register
 */

#define PCR_DS_CONF_REG (DR_REG_PCR_BASE + 0xe0)

/* PCR_DS_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset ds module
 */

#define PCR_DS_RST_EN    (BIT(1))
#define PCR_DS_RST_EN_M  (PCR_DS_RST_EN_V << PCR_DS_RST_EN_S)
#define PCR_DS_RST_EN_V  0x00000001
#define PCR_DS_RST_EN_S  1

/* PCR_DS_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable ds clock
 */

