apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_pcr.h
#define PCR_DS_CLK_EN    (BIT(0))
#define PCR_DS_CLK_EN_M  (PCR_DS_CLK_EN_V << PCR_DS_CLK_EN_S)
#define PCR_DS_CLK_EN_V  0x00000001
#define PCR_DS_CLK_EN_S  0

/* PCR_HMAC_CONF_REG register
 * HMAC configuration register
 */

#define PCR_HMAC_CONF_REG (DR_REG_PCR_BASE + 0xe4)

/* PCR_HMAC_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset hmac module
 */

#define PCR_HMAC_RST_EN    (BIT(1))
#define PCR_HMAC_RST_EN_M  (PCR_HMAC_RST_EN_V << PCR_HMAC_RST_EN_S)
#define PCR_HMAC_RST_EN_V  0x00000001
#define PCR_HMAC_RST_EN_S  1

/* PCR_HMAC_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable hmac clock
 */

#define PCR_HMAC_CLK_EN    (BIT(0))
#define PCR_HMAC_CLK_EN_M  (PCR_HMAC_CLK_EN_V << PCR_HMAC_CLK_EN_S)
#define PCR_HMAC_CLK_EN_V  0x00000001
#define PCR_HMAC_CLK_EN_S  0

/* PCR_IOMUX_CONF_REG register
 * IOMUX configuration register
 */

#define PCR_IOMUX_CONF_REG (DR_REG_PCR_BASE + 0xe8)

/* PCR_IOMUX_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset iomux module
 */

#define PCR_IOMUX_RST_EN    (BIT(1))
#define PCR_IOMUX_RST_EN_M  (PCR_IOMUX_RST_EN_V << PCR_IOMUX_RST_EN_S)
#define PCR_IOMUX_RST_EN_V  0x00000001
#define PCR_IOMUX_RST_EN_S  1

/* PCR_IOMUX_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable iomux apb clock
 */

#define PCR_IOMUX_CLK_EN    (BIT(0))
#define PCR_IOMUX_CLK_EN_M  (PCR_IOMUX_CLK_EN_V << PCR_IOMUX_CLK_EN_S)
#define PCR_IOMUX_CLK_EN_V  0x00000001
#define PCR_IOMUX_CLK_EN_S  0

/* PCR_IOMUX_CLK_CONF_REG register
 * IOMUX_CLK configuration register
 */

#define PCR_IOMUX_CLK_CONF_REG (DR_REG_PCR_BASE + 0xec)

/* PCR_IOMUX_FUNC_CLK_EN : R/W; bitpos: [22]; default: 1;
 * Set 1 to enable iomux function clock
 */

#define PCR_IOMUX_FUNC_CLK_EN    (BIT(22))
#define PCR_IOMUX_FUNC_CLK_EN_M  (PCR_IOMUX_FUNC_CLK_EN_V << PCR_IOMUX_FUNC_CLK_EN_S)
#define PCR_IOMUX_FUNC_CLK_EN_V  0x00000001
#define PCR_IOMUX_FUNC_CLK_EN_S  22

/* PCR_IOMUX_FUNC_CLK_SEL : R/W; bitpos: [21:20]; default: 3;
 * set this field to select clock-source. 0: do not select anyone clock, 1:
 * 80MHz, 2: FOSC, 3(default): XTAL.
 */

#define PCR_IOMUX_FUNC_CLK_SEL    0x00000003
#define PCR_IOMUX_FUNC_CLK_SEL_M  (PCR_IOMUX_FUNC_CLK_SEL_V << PCR_IOMUX_FUNC_CLK_SEL_S)
#define PCR_IOMUX_FUNC_CLK_SEL_V  0x00000003
#define PCR_IOMUX_FUNC_CLK_SEL_S  20

/* PCR_MEM_MONITOR_CONF_REG register
 * MEM_MONITOR configuration register
 */

#define PCR_MEM_MONITOR_CONF_REG (DR_REG_PCR_BASE + 0xf0)

/* PCR_MEM_MONITOR_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset mem_monitor module
 */

#define PCR_MEM_MONITOR_RST_EN    (BIT(1))
#define PCR_MEM_MONITOR_RST_EN_M  (PCR_MEM_MONITOR_RST_EN_V << PCR_MEM_MONITOR_RST_EN_S)
#define PCR_MEM_MONITOR_RST_EN_V  0x00000001
#define PCR_MEM_MONITOR_RST_EN_S  1

/* PCR_MEM_MONITOR_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable mem_monitor clock
 */

#define PCR_MEM_MONITOR_CLK_EN    (BIT(0))
#define PCR_MEM_MONITOR_CLK_EN_M  (PCR_MEM_MONITOR_CLK_EN_V << PCR_MEM_MONITOR_CLK_EN_S)
#define PCR_MEM_MONITOR_CLK_EN_V  0x00000001
#define PCR_MEM_MONITOR_CLK_EN_S  0

/* PCR_REGDMA_CONF_REG register
 * REGDMA configuration register
 */

#define PCR_REGDMA_CONF_REG (DR_REG_PCR_BASE + 0xf4)

/* PCR_REGDMA_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset regdma module
 */

#define PCR_REGDMA_RST_EN    (BIT(1))
#define PCR_REGDMA_RST_EN_M  (PCR_REGDMA_RST_EN_V << PCR_REGDMA_RST_EN_S)
#define PCR_REGDMA_RST_EN_V  0x00000001
#define PCR_REGDMA_RST_EN_S  1

/* PCR_REGDMA_CLK_EN : R/W; bitpos: [0]; default: 0;
 * Set 1 to enable regdma clock
 */

#define PCR_REGDMA_CLK_EN    (BIT(0))
#define PCR_REGDMA_CLK_EN_M  (PCR_REGDMA_CLK_EN_V << PCR_REGDMA_CLK_EN_S)
#define PCR_REGDMA_CLK_EN_V  0x00000001
#define PCR_REGDMA_CLK_EN_S  0

/* PCR_RETENTION_CONF_REG register
 * retention configuration register
 */

#define PCR_RETENTION_CONF_REG (DR_REG_PCR_BASE + 0xf8)

/* PCR_RETENTION_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset retention module
 */

#define PCR_RETENTION_RST_EN    (BIT(1))
#define PCR_RETENTION_RST_EN_M  (PCR_RETENTION_RST_EN_V << PCR_RETENTION_RST_EN_S)
#define PCR_RETENTION_RST_EN_V  0x00000001
#define PCR_RETENTION_RST_EN_S  1

/* PCR_RETENTION_CLK_EN : R/W; bitpos: [0]; default: 0;
 * Set 1 to enable retention clock
 */

#define PCR_RETENTION_CLK_EN    (BIT(0))
#define PCR_RETENTION_CLK_EN_M  (PCR_RETENTION_CLK_EN_V << PCR_RETENTION_CLK_EN_S)
#define PCR_RETENTION_CLK_EN_V  0x00000001
#define PCR_RETENTION_CLK_EN_S  0

/* PCR_TRACE_CONF_REG register
 * TRACE configuration register
 */

#define PCR_TRACE_CONF_REG (DR_REG_PCR_BASE + 0xfc)

/* PCR_TRACE_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset trace module
 */

#define PCR_TRACE_RST_EN    (BIT(1))
#define PCR_TRACE_RST_EN_M  (PCR_TRACE_RST_EN_V << PCR_TRACE_RST_EN_S)
#define PCR_TRACE_RST_EN_V  0x00000001
#define PCR_TRACE_RST_EN_S  1

/* PCR_TRACE_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable trace clock
 */

#define PCR_TRACE_CLK_EN    (BIT(0))
#define PCR_TRACE_CLK_EN_M  (PCR_TRACE_CLK_EN_V << PCR_TRACE_CLK_EN_S)
#define PCR_TRACE_CLK_EN_V  0x00000001
#define PCR_TRACE_CLK_EN_S  0

/* PCR_ASSIST_CONF_REG register
 * ASSIST configuration register
 */

#define PCR_ASSIST_CONF_REG (DR_REG_PCR_BASE + 0x100)

/* PCR_ASSIST_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset assist module
 */

#define PCR_ASSIST_RST_EN    (BIT(1))
#define PCR_ASSIST_RST_EN_M  (PCR_ASSIST_RST_EN_V << PCR_ASSIST_RST_EN_S)
#define PCR_ASSIST_RST_EN_V  0x00000001
#define PCR_ASSIST_RST_EN_S  1

/* PCR_ASSIST_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable assist clock
 */

#define PCR_ASSIST_CLK_EN    (BIT(0))
#define PCR_ASSIST_CLK_EN_M  (PCR_ASSIST_CLK_EN_V << PCR_ASSIST_CLK_EN_S)
#define PCR_ASSIST_CLK_EN_V  0x00000001
#define PCR_ASSIST_CLK_EN_S  0

/* PCR_CACHE_CONF_REG register
 * CACHE configuration register
 */

#define PCR_CACHE_CONF_REG (DR_REG_PCR_BASE + 0x104)

/* PCR_CACHE_RST_EN : R/W; bitpos: [1]; default: 0;
 * Set 0 to reset cache module
 */

#define PCR_CACHE_RST_EN    (BIT(1))
#define PCR_CACHE_RST_EN_M  (PCR_CACHE_RST_EN_V << PCR_CACHE_RST_EN_S)
#define PCR_CACHE_RST_EN_V  0x00000001
#define PCR_CACHE_RST_EN_S  1

/* PCR_CACHE_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Set 1 to enable cache clock
 */

#define PCR_CACHE_CLK_EN    (BIT(0))
#define PCR_CACHE_CLK_EN_M  (PCR_CACHE_CLK_EN_V << PCR_CACHE_CLK_EN_S)
#define PCR_CACHE_CLK_EN_V  0x00000001
#define PCR_CACHE_CLK_EN_S  0

