apache/nuttx/arch/risc-v/src/esp32c6/hardware/esp32c6_pcr.h
/* PCR_CTRL_32K_CONF_REG register
 * 32KHz clock configuration register
 */

#define PCR_CTRL_32K_CONF_REG (DR_REG_PCR_BASE + 0x134)

/* PCR_32K_SEL : R/W; bitpos: [1:0]; default: 0;
 * This field indicates which one 32KHz clock will be used by MODEM_SYSTEM
 * and timergroup. 0: OSC32K(default), 1: XTAL32K, 2/3: 32KHz from pad GPIO0.
 */

#define PCR_32K_SEL    0x00000003
#define PCR_32K_SEL_M  (PCR_32K_SEL_V << PCR_32K_SEL_S)
#define PCR_32K_SEL_V  0x00000003
#define PCR_32K_SEL_S  0

/* PCR_SRAM_POWER_CONF_REG register
 * HP SRAM/ROM configuration register
 */

#define PCR_SRAM_POWER_CONF_REG (DR_REG_PCR_BASE + 0x138)

/* PCR_ROM_CLKGATE_FORCE_ON : R/W; bitpos: [20:18]; default: 0;
 * 1: Force to open the clock and bypass the gate-clock when accessing the
 * ROM. 0: A gate-clock will be used when accessing the ROM.
 */

#define PCR_ROM_CLKGATE_FORCE_ON    0x00000007
#define PCR_ROM_CLKGATE_FORCE_ON_M  (PCR_ROM_CLKGATE_FORCE_ON_V << PCR_ROM_CLKGATE_FORCE_ON_S)
#define PCR_ROM_CLKGATE_FORCE_ON_V  0x00000007
#define PCR_ROM_CLKGATE_FORCE_ON_S  18

/* PCR_ROM_FORCE_PD : R/W; bitpos: [17:15]; default: 0;
 * Set this bit to force power down ROM.
 */

#define PCR_ROM_FORCE_PD    0x00000007
#define PCR_ROM_FORCE_PD_M  (PCR_ROM_FORCE_PD_V << PCR_ROM_FORCE_PD_S)
#define PCR_ROM_FORCE_PD_V  0x00000007
#define PCR_ROM_FORCE_PD_S  15

/* PCR_ROM_FORCE_PU : R/W; bitpos: [14:12]; default: 7;
 * Set this bit to force power up ROM
 */

#define PCR_ROM_FORCE_PU    0x00000007
#define PCR_ROM_FORCE_PU_M  (PCR_ROM_FORCE_PU_V << PCR_ROM_FORCE_PU_S)
#define PCR_ROM_FORCE_PU_V  0x00000007
#define PCR_ROM_FORCE_PU_S  12

/* PCR_SRAM_CLKGATE_FORCE_ON : R/W; bitpos: [11:8]; default: 0;
 * 1: Force to open the clock and bypass the gate-clock when accessing the
 * SRAM. 0: A gate-clock will be used when accessing the SRAM.
 */

#define PCR_SRAM_CLKGATE_FORCE_ON    0x0000000f
#define PCR_SRAM_CLKGATE_FORCE_ON_M  (PCR_SRAM_CLKGATE_FORCE_ON_V << PCR_SRAM_CLKGATE_FORCE_ON_S)
#define PCR_SRAM_CLKGATE_FORCE_ON_V  0x0000000f
#define PCR_SRAM_CLKGATE_FORCE_ON_S  8

/* PCR_SRAM_FORCE_PD : R/W; bitpos: [7:4]; default: 0;
 * Set this bit to force power down SRAM.
 */

#define PCR_SRAM_FORCE_PD    0x0000000f
#define PCR_SRAM_FORCE_PD_M  (PCR_SRAM_FORCE_PD_V << PCR_SRAM_FORCE_PD_S)
#define PCR_SRAM_FORCE_PD_V  0x0000000f
#define PCR_SRAM_FORCE_PD_S  4

/* PCR_SRAM_FORCE_PU : R/W; bitpos: [3:0]; default: 15;
 * Set this bit to force power up SRAM
 */

#define PCR_SRAM_FORCE_PU    0x0000000f
#define PCR_SRAM_FORCE_PU_M  (PCR_SRAM_FORCE_PU_V << PCR_SRAM_FORCE_PU_S)
#define PCR_SRAM_FORCE_PU_V  0x0000000f
#define PCR_SRAM_FORCE_PU_S  0

/* PCR_RESET_EVENT_BYPASS_REG register
 * reset event bypass backdoor configuration register
 */

#define PCR_RESET_EVENT_BYPASS_REG (DR_REG_PCR_BASE + 0xff0)

/* PCR_RESET_EVENT_BYPASS : R/W; bitpos: [1]; default: 1;
 * This field is used to control reset event relationship for system-bus. 1:
 * system bus (including arbiter/router) will only be reset by power-reset.
 * some reset event will be bypass. 0: system bus (including arbiter/router)
 * will not only be reset by power-reset, but also some reset event.
 */

#define PCR_RESET_EVENT_BYPASS    (BIT(1))
#define PCR_RESET_EVENT_BYPASS_M  (PCR_RESET_EVENT_BYPASS_V << PCR_RESET_EVENT_BYPASS_S)
#define PCR_RESET_EVENT_BYPASS_V  0x00000001
#define PCR_RESET_EVENT_BYPASS_S  1

/* PCR_RESET_EVENT_BYPASS_APM : R/W; bitpos: [0]; default: 0;
 * This field is used to control reset event relationship for
 * tee_reg/apm_reg/hp_system_reg. 1: tee_reg/apm_reg/hp_system_reg will only
 * be reset by power-reset. some reset event will be bypass. 0:
 * tee_reg/apm_reg/hp_system_reg will not only be reset by power-reset, but
 * also some reset event.
 */

#define PCR_RESET_EVENT_BYPASS_APM    (BIT(0))
#define PCR_RESET_EVENT_BYPASS_APM_M  (PCR_RESET_EVENT_BYPASS_APM_V << PCR_RESET_EVENT_BYPASS_APM_S)
#define PCR_RESET_EVENT_BYPASS_APM_V  0x00000001
#define PCR_RESET_EVENT_BYPASS_APM_S  0

/* PCR_FPGA_DEBUG_REG register
 * fpga debug register
 */

#define PCR_FPGA_DEBUG_REG (DR_REG_PCR_BASE + 0xff4)

/* PCR_FPGA_DEBUG : R/W; bitpos: [31:0]; default: 4294967295;
 * Only used in fpga debug.
 */

#define PCR_FPGA_DEBUG    0xffffffff
#define PCR_FPGA_DEBUG_M  (PCR_FPGA_DEBUG_V << PCR_FPGA_DEBUG_S)
#define PCR_FPGA_DEBUG_V  0xffffffff
#define PCR_FPGA_DEBUG_S  0

/* PCR_CLOCK_GATE_REG register
 * PCR clock gating configure register
 */

#define PCR_CLOCK_GATE_REG (DR_REG_PCR_BASE + 0xff8)

/* PCR_CLK_EN : R/W; bitpos: [0]; default: 0;
 * Set this bit as 1 to force on clock gating.
 */

#define PCR_CLK_EN    (BIT(0))
#define PCR_CLK_EN_M  (PCR_CLK_EN_V << PCR_CLK_EN_S)
#define PCR_CLK_EN_V  0x00000001
#define PCR_CLK_EN_S  0

/* PCR_DATE_REG register
 * Date register.
 */

#define PCR_DATE_REG (DR_REG_PCR_BASE + 0xffc)

/* PCR_DATE : R/W; bitpos: [27:0]; default: 35676496;
 * PCR version information.
 */

#define PCR_DATE    0x0fffffff
#define PCR_DATE_M  (PCR_DATE_V << PCR_DATE_S)
#define PCR_DATE_V  0x0fffffff
#define PCR_DATE_S  0

#endif /* __ARCH_RISCV_SRC_ESP32C6_HARDWARE_ESP32C6_PCR_H */
